app/controllers/evaluations_controller.rb

  	def index
		@evaluations = Evaluation.all
		@continue = Array.new
		@last_grade = Array.new
		if current_user
			@evaluations.each do |evaluation|
				@continue[evaluation.id] = false
				@last_test = Test.where( :user_id => current_user.id,
  			                     		 :evaluation_id => evaluation.id ).last
				@last_grade[evaluation.id] = Test.where( :user_id => current_user.id,
  			                     		  :evaluation_id => evaluation.id,
  			                      		  :grade =>  0.9..7.1 ).last
---
SELECT "evaluations".* FROM "evaluations"
SELECT  "tests".* FROM "tests" WHERE "tests"."user_id" = ? AND "tests"."evaluation_id" = ?  ORDER BY "tests"."id" DESC LIMIT 1  [["user_id", 8], ["evaluation_id", 1]]
SELECT  "tests".* FROM "tests" WHERE "tests"."user_id" = ? AND "tests"."evaluation_id" = ? AND ("tests"."grade" BETWEEN 0.9 AND 7.1)  ORDER BY "tests"."id" DESC LIMIT 1  [["user_id", 8], ["evaluation_id", 1]]