app/controllers/heuristics_controller.rb

SELECT "heuristics".* FROM "heuristics"
---
  def index
  	@heuristics = Heuristic.all

SELECT  "heuristics".* FROM "heuristics" WHERE "heuristics"."id" = ? LIMIT 1  [["id", 1]]
SELECT "donts".* FROM "donts" WHERE "donts"."heuristic_id" = ?  [["heuristic_id", 1]]
SELECT "examples".* FROM "examples" WHERE "examples"."heuristic_id" = ?  [["heuristic_id", 1]]
SELECT "references".* FROM "references" WHERE "references"."heuristic_id" = ?  [["heuristic_id", 1]]
---
  def show
  	@heuristic = Heuristic.find(params[:heuristic_id])
  	@dos = Do.where(heuristic_id: params[:heuristic_id])
  	@donts = Dont.where(heuristic_id: params[:heuristic_id])
  	@examples = Example.where(heuristic_id: params[:heuristic_id])
  	@references = Reference.where(heuristic_id: params[:heuristic_id])