app/controllers/practices_controller.rb

SELECT "practices".* FROM "practices"
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."user_id" = ? AND "exercises"."practice_id" = ?  ORDER BY "exercises"."id" DESC LIMIT 1  [["user_id", 8], ["practice_id", 1]]
---
	def index
		@practices = Practice.all
		if current_user
			@exercises = Hash.new
			@actions = Hash.new
			@practices.each do |practice|
				@exercises[practice.id] = Exercise.where(user_id: current_user.id,
			                         					 practice_id: practice.id).last