app/controllers/users_controller.rb

	def index
    @evaluation = Evaluation.find(1)
    @user = User.new
    #@searching = false
    #per_page = 10
    #if params[:per_page]
    #  per_page = params[:per_page].to_i
    #end

    @users = User.all
---
SELECT "users".* FROM "users"

	def show
		@user = User.find(params[:id])
		#@tests = Array.new
		#@evaluations = Evaluation.all
		@evaluation = Evaluation.find(1)
		@lastTest = Test.where( :user_id => @user.id, :grade =>  0.9..7.1 ).last

    		#Solicitado: Objeto test con todos los tests realizados:
    		@userTests = Test.where( :user_id => @user.id )

		#ME RETORNA TODOS LOS DATOS DEL USUARIO RESPECTIVO
		#LOS LLENE MANUALMENTE EN LA BASE DE DATOS MIENTRAS
		#INTENTE CREAR UN ARREGLO ALTIRO EN EL CODIGO PERO ME TIRABA UN ERROR
		#SOLO ME PODIA CREAR UN TEST CON VALORES DETERMINADOS POR MI, NO UN ARRAY =/


		##DEFINO MEJOR NOTA, PEOR NOTA y PROMEDIO
		@mejorNota = 0
		@peorNota = 7.0
		@promedioNota = 0
		sumadorNotas = 0
		cantidadNotas = 0

		##RECORRO EL ARRAY PARA OBTENER LA MEJOR PEOR Y PROMEDIO DE NOTA

		@userTests.each do |test|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "evaluations".* FROM "evaluations" WHERE "evaluations"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "tests".* FROM "tests" WHERE "tests"."user_id" = ? AND ("tests"."grade" BETWEEN 0.9 AND 7.1)  ORDER BY "tests"."id" DESC LIMIT 1  [["user_id", 3]]
SELECT "tests".* FROM "tests"

	def destroy
		@user = User.find(params[:id])
		if @user.admin
			flash[:danger] = "El usuario es administrador del sistema y no puede ser eliminado"
		else
			@user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]