app/views/layouts/_header2.html.erb

SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = ?  [["user_id", 1]]
---
							<li><%= link_to 'Editar Perfil',edit_user_registration_path %></li>
							<% if (Chat.where(user_id: current_user.id).length > 0) || (current_user.admin?) %>